tutorials/streetCanyonOnlyAir/constant/air/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       15000;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       15060;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       15120;
    }
    ground
    {
        type            wall;
        nFaces          40;
        startFace       15220;
    }
    sides
    {
        type            empty;
        nFaces          15200;
        startFace       15260;
    }
    walls
    {
        type            wall;
        nFaces          140;
        startFace       30460;
    }
)

// ************************************************************************* //
