tutorials/streetCanyonOnlyAir/0/air/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    top
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 100000;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 100000;
    }
    ground      
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
    walls      
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }	
    sides
    {
        type            empty;
    }
}

// ************************************************************************* //
